Extensions/АБ/Catalogs/АдреснаяКнига.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>АдреснаяКнига</Name>
		</Properties>
	</Catalog>
</MetaDataObject>

Extensions/АБ/Enums/УВМ_ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УВМ_ТипыКонтрагентов</Name>
			<Comment>Задача 326149</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конкурент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевозчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подрядчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОтношения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХранительАрендодатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/АБ/Catalogs/АдреснаяКнига/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
&Перед("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++dar 04.05.26 (326149)
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтотОбъект, "УВМ_ОткрытаИзДокумента", УВМ_РаботаСФормами.ОписаниеТипаБулево());
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтотОбъект, "УВМ_ТипКонтрагента", УВМ_РаботаСФормами.ОписаниеТипаПеречисление("УВМ_ТипыКонтрагентов"));
	
	ЭтотОбъект.УВМ_ОткрытаИзДокумента = Ложь;
	ЭтотОбъект.УВМ_ТипКонтрагента = Перечисления.УВМ_ТипыКонтрагентов.ПустаяСсылка();
	//--dar 04.05.26 (326149)
КонецПроцедуры

&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере1(Отказ, СтандартнаяОбработка)
	//++dar 04.05.26 (326149)
	УВМ_ОткрытаИзДокумента = Ложь;
	УВМ_ТипКонтрагента = Перечисления.УВМ_ТипыКонтрагентов.ПустаяСсылка();
	
	Если Параметры.ОтображатьКонтрагентов Тогда
		Если Параметры.Свойство("УВМ_ОткрытаИзДокумента", УВМ_ОткрытаИзДокумента)
			И Параметры.Свойство("УВМ_ТипКонтрагента", УВМ_ТипКонтрагента) Тогда
		
			Если УВМ_ОткрытаИзДокумента И ЗначениеЗаполнено(УВМ_ТипКонтрагента) Тогда
				ОтборСписка = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
				
				// Создаем общую группу ИЛИ
				ГруппаИЛИ = ОтборСписка.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
				ГруппаИЛИ.Использование = Истина;
				
				// Условие 1: Это НЕ контрагент (значит, показываем всех остальных: сотрудников, роли и т.д.)
				ЭлементНеКонтрагент = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементНеКонтрагент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТипДанныхОбъекта");
				ЭлементНеКонтрагент.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
				ЭлементНеКонтрагент.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ТипыДанныхАдреснойКниги.Контрагент");
				ЭлементНеКонтрагент.Использование  = Истина;
				
				// Условие 2: Это контрагент И у него стоит флаг УВМ_Клиент
				// Для этого внутри группы ИЛИ создаем группу И
				ГруппаИ = ГруппаИЛИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
				ГруппаИ.Использование = Истина;
				
				// 2.1. Тип = Контрагент
				ЭлементЭтоКонтрагент = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементЭтоКонтрагент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТипДанныхОбъекта");
				ЭлементЭтоКонтрагент.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементЭтоКонтрагент.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ТипыДанныхАдреснойКниги.Контрагент");
				
				// 2.2. Флаг Клиент = Истина
				ИмяПоляКонтрагента = ИмяПоляКонтрагентаПоТипу(УВМ_ТипКонтрагента, "Объект");
				
				ЭлементКлиентИстина = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементКлиентИстина.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяПоляКонтрагента);
				ЭлементКлиентИстина.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементКлиентИстина.ПравоеЗначение = Истина;		
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	

	ЭтотОбъект.УВМ_ОткрытаИзДокумента = УВМ_ОткрытаИзДокумента;
	ЭтотОбъект.УВМ_ТипКонтрагента = УВМ_ТипКонтрагента;
	//--dar 04.05.26 (326149)
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++dar 04.05.26 (326149)
&НаСервере
Функция ИмяПоляКонтрагентаПоТипу(ТипКонтрагента, ИмяОбъекта)
	
	Результат = "";
	Если ТипКонтрагента = Перечисления.УВМ_ТипыКонтрагентов.Клиент Тогда
		Результат = ИмяОбъекта + ".УВМ_Клиент";	
	ИначеЕсли ТипКонтрагента = Перечисления.УВМ_ТипыКонтрагентов.Конкурент Тогда
		Результат = ИмяОбъекта + ".УВМ_Конкурент";
	ИначеЕсли ТипКонтрагента = Перечисления.УВМ_ТипыКонтрагентов.Перевозчик Тогда
		Результат = ИмяОбъекта + ".УВМ_Перевозчик";
	ИначеЕсли ТипКонтрагента = Перечисления.УВМ_ТипыКонтрагентов.Подрядчик Тогда
		Результат = ИмяОбъекта + ".УВМ_Подрядчик";
	ИначеЕсли ТипКонтрагента = Перечисления.УВМ_ТипыКонтрагентов.Поставщик Тогда
		Результат = ИмяОбъекта + ".УВМ_Поставщик";
	ИначеЕсли ТипКонтрагента = Перечисления.УВМ_ТипыКонтрагентов.ПрочиеОтношения Тогда
		Результат = ИмяОбъекта + ".УВМ_ПрочиеОтношения";
	ИначеЕсли ТипКонтрагента = Перечисления.УВМ_ТипыКонтрагентов.ХранительАрендодатель Тогда
		Результат = ИмяОбъекта + ".УВМ_Хранитель_Арендодатель";
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции
//--dar 04.05.26 (326149)

&НаСервере
&После("ОбновитьПараметрыСпискаРезультатПоиска")
Процедура АБ_ОбновитьПараметрыСпискаРезультатПоиска()
	//++dar 04.05.26 (326149)
	Если ЭтотОбъект.УВМ_ОткрытаИзДокумента И ЗначениеЗаполнено(ЭтотОбъект.УВМ_ТипКонтрагента) Тогда
		ОтборСписка = РезультатПоиска.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
		
		// Создаем общую группу ИЛИ
		ГруппаИЛИ = ОтборСписка.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
		ГруппаИЛИ.Использование = Истина;
		
		// Условие 1: Это НЕ контрагент (значит, показываем всех остальных: сотрудников, роли и т.д.)
		ЭлементНеКонтрагент = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементНеКонтрагент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТипОбъектаПоиска");
		ЭлементНеКонтрагент.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементНеКонтрагент.ПравоеЗначение = Тип("СправочникСсылка.Контрагенты");
		ЭлементНеКонтрагент.Использование  = Истина;
		
		// Условие 2: Это контрагент И у него стоит флаг УВМ_Клиент
		// Для этого внутри группы ИЛИ создаем группу И
		ГруппаИ = ГруппаИЛИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ГруппаИ.Использование = Истина;
		
		// 2.1. Тип = Контрагент
		ЭлементЭтоКонтрагент = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементЭтоКонтрагент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТипОбъектаПоиска");
		ЭлементЭтоКонтрагент.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементЭтоКонтрагент.ПравоеЗначение = Тип("СправочникСсылка.Контрагенты");
		
		// 2.2. Флаг Клиент = Истина
		ИмяПоляКонтрагента = ИмяПоляКонтрагентаПоТипу(ЭтотОбъект.УВМ_ТипКонтрагента, "ОбъектПоиска");
		
		ЭлементКлиентИстина = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементКлиентИстина.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяПоляКонтрагента);
		ЭлементКлиентИстина.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементКлиентИстина.ПравоеЗначение = Истина;
	КонецЕсли;
	//--dar 04.05.26 (326149)
КонецПроцедуры

#КонецОбласти
